<?php

return [

    /*
    |--------------------------------------------------------------------------
    | قسم موظفي التوصيل
    |--------------------------------------------------------------------------
    */

    'deliveryAgent' => [

        'menu' => [
            'title'             => 'خدمات التوصيل',
            'delivery-agents'   => 'مندوبين التوصيل',
        ],

        'acl' => [
            'title'             => 'خدمات التوصيل',
            'delivery-agents'   => 'مندوبين التوصيل',
            'create'            => 'إضافة',
            'edit'              => 'تحرير',
            'delete'            => 'حذف',
        ],
        'system' => [
            'title'    => 'إدارة التوصيل',
            'info'     => 'إعدادات شاملة خاصة بخدمة التوصيل',

            'settings' => [
                'title'    => 'إعدادات التوصيل',
                'info'     => 'إدارة وضبط إعدادات خدمة التوصيل',

                'general'  => [
                    'title'  => 'الإعدادات العامة',
                    'info'   => 'ضبط الإعدادات الأساسية الخاصة بنظام التوصيل',
                    'fields' => [
                        'enable-delivery-system'=> 'تفعيل خدمة التوصيل',
                    ],
                ],

                'store' => [
                    'title'      => 'إعدادات المتجر',
                    'store-info' => 'ضبط الإعدادات المتعلقة بالمتجر',
                    'fields'     => [
                        'default-country' => 'الدولة الافتراضية للمتجر',
                    ],
                ],

                'agent' => [
                    'title'  => 'إعدادات المندوب',
                    'info'   => 'التحكم بالإعدادات العامة الخاصة بالمناديب',
                    'fields' => [
                        // هنا ممكن نضيف لاحقًا إعدادات مثل "عدد الطلبات القصوى للمندوب"
                    ],
                ],

                'ranges' => [
                    'title'  => 'إعدادات نطاقات التوصيل',
                    'info'   => 'التحكم بطريقة تحديد النطاقات للمندوبين',
                    'fields' => [
                        'allow-multiple-ranges' => 'السماح بإنشاء عدة نطاقات للمندوب',
                    ],
                ],

                'orders' => [
                    'title'  => 'إعدادات الطلبات',
                    'info'   => 'إدارة الإعدادات الخاصة بطلبات التوصيل',
                    'fields' => [
                        'allow_agent_acceptance'=> 'السماح لمندوب التوصيل بقبول او رفض الطلبات',
                    ],
                ],
            ],
        ],

        'index' => [
            'title' => 'قائمة مناديب التوصيل',
        ],

        'view' => [
            'title'         => 'المندوب',
            'back-btn'      => 'رجوع إلى القائمة',
            'delivery-agent'=> 'اسم المندوب',
            'first-name'    => 'الاسم الأول',
            'last-name'     => 'الاسم الأخير',
            'phone'         => 'رقم التواصل - :phone',
            'email'         => 'البريد الإلكتروني - :email',
            'date-of-birth' => 'تاريخ الميلاد - :dob',
            'gender'        => 'النوع - :gender',
            'status'        => 'الحالة الحالية',
            'active'        => 'مفعل',
            'inactive'      => 'غير مفعل',
            'edit-btn'      => 'تحرير',
            'dataGrid'      => [
                'orders'        => [
                    'count'      => 'الطلبيات (:count)',
                    'empty-order'=> 'لا توجد طلبيات',
                ],
            ],

        ],

        'orders'=> [
            'view'=> [
                'accepted-order-confirmation'        => 'هل أنت متأكد أنك تريد قبول هذا الطلب؟',
                'rejected-order-confirmation'        => 'هل أنت متأكد أنك تريد رفض هذا الطلب؟',
                'out-for-delivery-order-confirmation'=> 'هل أنت متأكد من تغيير حالة الطلب إلى "جاري التوصيل"؟ بعد التأكيد، لايمكنك  تعديل حالة الطلب.',
                'delivered-order-confirmation'       => 'هل أنت متأكد من تغيير حالة الطلب إلى "تم التوصيل"؟ بعد التأكيد، سيتم إغلاق الطلب ولن يمكن تعديله.',
            ],
            'status'=> [
                'assigned_to_agent'   => 'طلب جديد',
                'accepted_by_agent'   => ' طلب مقبول',
                'rejected_by_agent'   => 'طلب مرفوض ',
                'out_for_delivery'    => 'جاري التوصيل',
                'delivered'           => 'تم التوصيل',
            ],
            'actions'=> [
                'accept_btn'          => 'قبول',
                'reject_btn'          => 'رفض',
                'out_for_delivery_btn'=> 'توصيل',
                'delivered_btn'       => 'تسليم',
            ],
            'acl'=> [
                'accept'          => 'قبول الطلب',
                'reject'          => ' رفض الطلب',
                'out_for_delivery'=> 'توصيل الطلب',
                'delivered'       => 'تسليم الطلب',
            ],
        ],

        'create' => [
            'title'             => 'إضافة مندوب توصيل جديد',
            'create-btn'        => 'حفظ البيانات',
            'create'            => 'إضافة مندوب',
            'first-name'        => 'الاسم الأول',
            'last-name'         => 'الاسم الأخير',
            'phone'             => 'رقم الهاتف',
            'email'             => 'البريد الإلكتروني',
            'date-of-birth'     => 'تاريخ الميلاد',
            'gender'            => 'النوع',
            'select-gender'     => 'اختر النوع',
            'male'              => 'ذكر',
            'female'            => 'أنثى',
            'other'             => 'أخرى',
            'password'          => 'كلمة المرور الجديدة',
            'confirm-password'  => 'تأكيد كلمة المرور',
            'status'            => 'حالة الحساب',
            'select-status'     => 'اختر الحالة',
            'active'            => 'مفعل',
            'inactive'          => 'متوقف مؤقتًا',
            'create-success'    => 'تمت إضافة الموظف بنجاح.',
        ],

        'delete' => [
            'successful_deletion_message'   => 'تم حذف الموظف بنجاح.',
            'unsuccessful_deletion_message' => 'تعذر حذف الموظف. حاول لاحقًا.',
        ],

        'edit' => [
            'title'                       => 'تحرير بيانات المندوب',
            'edit-btn'                    => 'حفظ التعديلات',
            'save-btn'                    => 'تحديث',
            'edit-success'                => 'تم تحديث بيانات المندوب بنجاح.',
            'first-name'                  => 'الاسم الأول',
            'last-name'                   => 'الاسم الأخير',
            'phone'                       => 'رقم الهاتف',
            'email'                       => 'البريد الإلكتروني',
            'date-of-birth'               => 'تاريخ الميلاد',
            'gender'                      => 'النوع',
            'select-gender'               => 'اختر النوع',
            'male'                        => 'ذكر',
            'female'                      => 'أنثى',
            'other'                       => 'أخرى',
            'current_password'            => 'كلمة المرور السابقة ',
            'password'                    => 'كلمة المرور الجديدة',
            'confirm-password'            => 'تأكيد كلمة المرور',
            'status'                      => 'حالة الحساب',
            'select-status'               => 'اختر الحالة',
            'active'                      => 'مفعل',
            'inactive'                    => 'متوقف مؤقتًا',
            'incorrect_current_password'  => 'كلمة المرور السابقة غير متطابقة ',

        ],

        'dataGrid' => [
            'id'                => 'المعرف',
            'id-value'          => 'المعرف - :id',
            'name'              => 'اسم المندوب',
            'phone'             => 'رقم الهاتف',
            'email'             => 'البريد الإلكتروني',
            'gender'            => 'الجنس',
            'status'            => 'الحالة',
            'active'            => 'مفعل',
            'inactive'          => 'متوقف',
            'range-count'       => 'عدد النطاقات',
            'order_count'       => 'عدد الطلبيات',
            'range'             => ':range نطاق(نطاقات)',
            'order'             => ':order طلب(طلبيات)',
            'country'           => 'الدولة',
            'state'             => 'الولاية',
            'actions'           => [
                'view'  => 'عرض',
                'delete'=> 'حذف',
            ],
            'delete'                        => 'حذف',
            'update-status'                 => 'تحديث الحالة',
            'delete-success'                => 'تم حذف المندوب بنجاح',
            'update-success'                => 'تم نحديث الحالة بنجاح',
            'unsuccessful_deletion_message' => 'لا يمكن حذف المندوب لوجود طلبات غير مكتملة.',

            'orders'        => [
                'status'=> [
                    'assigned_to_agent'   => 'الطلبات الجديدة',
                    'accepted_by_agent'   => 'الطلبات المقبولة',
                    'rejected_by_agent'   => 'الطلبات المرفوضة',
                    'out_for_delivery'    => 'الطلبات قيد التوصيل',
                    'delivered'           => 'الطلبات المكتملة',
                ],
            ],

        ],

        'form' => [
            'name'      => 'الاسم الكامل',
            'phone'     => 'رقم الهاتف',
            'email'     => 'البريد الإلكتروني',
            'password'  => 'كلمة المرور',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | قسم المناطق (المدن والولايات)
    |--------------------------------------------------------------------------
    */

    'country' => [

        'menu' => [
            'title'     => 'نطاقات التوصيل',
            'countries' => 'البلدان',
        ],

        'acl' => [
            'title'         => 'نطاقات التوصيل',
            'countries'     => 'البلدان',
            'create'        => 'إضافة ',
            'edit'          => 'تحرير ',
            'delete'        => 'حذف ',
        ],

        'dataGrid' => [
            'id'            => 'المعرف',
            'name'          => 'اسم البلدة',
            'code'          => 'رمز البلدة',
            'states_count'  => 'عدد المناطق',
            'actions'       => [
                'view'  => 'عرض',
                'delete'=> 'حذف',
            ],
            'delete-success'             => 'تم الحذف  بنجاح',
            'no-found'                   => 'فشل الحذف ',
            'mass-delete-success'        => 'تم حذف البلدان المحددة  بنجاح',
            'delete_warning_has_children'=> 'لا يمكن حذف البلدة لأنها تحتوي على ابناء.',
        ],

        'index' => [
            'title' => 'قائمة البلدان المتاحة',
        ],

        'create' => [
            'title'             => 'إضافة بلدة جديدة',
            'name'              => 'اسم البلدة',
            'code'              => 'رمز البلدة',
            'create-btn'        => 'حفظ ',
            'index-create-btn'  => 'إضافة بلدة',
            'create-success'    => 'تمت إضافة البلدة بنجاح.',
        ],

        'view' => [
            'title'               => 'تفاصيل البلدة',
            'back-btn'            => 'رجوع',
            'delete-btn'          => 'حذف البلدو',
            'country'             => 'البلدة',
            'name'                => 'اسم البلدة',
            'code'                => 'رمز البلدة',

            'states' => [
                'count'         => 'عدد المناطق :count',
                'create-btn'    => 'إضافة منطقة جديدة',
            ],
        ],

        'edit' => [
            'title'         => 'تحرير بيانات البلدة',
            'name'          => 'اسم البلدة',
            'code'          => 'رمز البلدة',
            'edit-btn'      => 'تحرير',
            'edit-success'  => 'تم تحديث بيانات البلدة بنجاح.',
        ],

        'state' => [
            'acl' => [
                'states'        => 'المناطق',
                'view'          => 'عرض ',
                'create'        => 'إضافة ',
                'edit'          => 'تحرير ',
                'delete'        => 'حذف ',
            ],
            'create' => [
                'title'             => 'إضافة منطقة جديدة',
                'name'              => 'اسم المنطقة',
                'code'              => 'رمز المنطقة',
                'create-btn'        => 'حفظ المنطقة',
                'create-success'    => 'تم حفظ المنطقة بنجاح.',
            ],
            'view' => [
                'title'                => 'تفاصيل المنطقة ',
                'back-btn'             => 'رجوع',
                'delete-btn'           => 'حذف المنطقة',
                'state'                => 'المنطقة',
                'create-area-btn'      => 'إضافة مدينة - حي سكني',
                'name'                 => 'اسم المنطقة',
                'code'                 => 'رمز المنطقة',
            ],
            'edit' => [
                'title'         => 'تحرير بيانات المنطقة',
                'name'          => 'اسم المنطقة',
                'code'          => 'رمز المنطقة',
                'edit-btn'      => 'تحرير',
                'edit-success'  => 'تم تحديث بيانات المنطقة بنجاح.',
            ],

            'dataGrid' => [
                'id'                => 'الـمعرف',
                'name'              => 'اسم المنطقة',
                'code'              => 'رمز المنطقة',
                'actions'           => [
                    'view'  => 'عرض',
                    'delete'=> 'حذف',
                ],
                'delete-success'             => 'تم الحذف المنطقة بنجاح',
                'no-found'                   => 'لم يتم المنطقة الحذف بنجاح',
                'mass-delete-success'        => 'تم حذف المناطق المحددة  بنجاح',
                'delete_warning_has_children'=> 'لا يمكن حذف المنطقة لأنها تحتوي على ابناء.',

            ],
            'area'=> [
                'create'=> [
                    'title'         => 'إضافة مدينة / حي جديد',
                    'name'          => 'اسم المدينة او الحــي',
                    'save-btn'      => 'حفظ',
                    'create-success'=> 'تم اضافة المدينة بنجاح',

                ],
                'edit'=> [
                    'title'         => 'تعديل المدينة او الحــي ',
                    'name'          => 'اسم المدينة او الحــي',
                    'edit-btn'      => 'تعديل',
                    'edit-success'  => 'تم التحديث بنجاح',
                ],
                'view'=> [
                    'title'   => 'قائمة مناديب ',
                    'add-btn' => 'اضف مندوب',
                    'drawer'  => [
                        'header'=> 'اضافة مناديب فــي ',
                    ],
                    'dataGrid'=> [
                        'delete-from-area'    => 'ازالة من المنطقة',
                        'add-to-area'         => 'إضافة إلى المنطقة',
                        'add-success'         => 'تمت إضافة المناديب المحددين بنجاح إلى هذه المنطقة',
                        'deleted-success'     => 'تمت ازالة المناديب المحددين من هذه المنطقة',

                    ],

                ],
                'dataGrid'=> [
                    'id'                   => 'المعرف',
                    'name'                 => 'اسم المدينة او الحــي',
                    'delivery-count'       => 'عدد المناديب',
                    'actions'              => [
                        'edit'  => 'تعديل',
                        'delete'=> 'حذف',
                    ],
                    'delete-success'             => 'تم الحذف بنجاح',
                    'no-found'                   => 'فشلت عملية الحذف',
                    'delete_warning_has_children'=> 'لا يمكن حذف المدينة لأنها تحتوي على ابناء.',

                ],
                'acl'=> [
                    'areas'         => 'المدن او الاحياء',
                    'view'          => 'عرض ',
                    'create'        => 'إضافة ',
                    'edit'          => 'تحرير ',
                    'delete'        => 'حذف ',
                ],
            ],
        ],
    ],
    /*
   |--------------------------------------------------------------------------
   | قسم النطاقات الخاصة بالمندوبين والمناطق
   |--------------------------------------------------------------------------
   */
    'range'=> [
        'index' => [
            'title' => 'قائمة المدن المتاحة',

        ],
        'acl'=> [
            'title'         => 'نطاقات المندوب',
            'create'        => 'إضافة ',
            'edit'          => 'تحرير ',
            'delete'        => 'حذف ',
        ],
        'create' => [
            'title'                      => 'إضافة نطاق جديد',
            'area-name'                  => ' المدينة او الحــي',
            'country'                    => ' البلدة',
            'state'                      => 'المنطقة',
            'create-btn'                 => 'حفظ النطاق',
            'index-create-btn'           => 'إضافة',
            'select_country'             => 'اختر البلدة',
            'select_state'               => 'اختر المنطقة',
            'select_state_area'          => 'اختر الدولة او الحــي',
            'add_state'                  => 'اضافة منطقة',
            'add_area'                   => 'اضافة دولة او حــي',
            'no_states_for_country'      => 'لا توجد مناطق لهذه البلدة. الرجاء اختيار بلدة تحتوي على مناطق او اضف منطقة جديدة.',
            'no_areas_for_state'         => 'لا توجد دولة او حــي لهذه المنطقة. الرجاء اختيار منطقة تحتوي على دول او احياء او اضف دولة او حــي .',
            'create-success'             => 'تمت إضافة النطاق للمندوب بنجاح.',
            'create-failed'              => 'هذا المندوب مسجل بالفعل في هذه المنطقة الجغرافية.',
            'multiple-not-allowed'       => 'لا يمكن إضافة أكثر من نطاق لهذا المندوب.',
        ],
        'view'=> [
            'count'                     => 'عدد النطاقات (:count)',
            'empty-title'               => 'إضافة نطاق للمندوب',
            'empty-description'         => 'إنشاء نطاقات جديدة للمندوب',
            'delete-btn'                => 'حذف',
            'range-delete-confirmation' => 'هل أنت متأكد أنك تريد حذف هذا النطاق؟',
            'range-delete-success'      => 'تم حذف النطاق بنجاح',
            'range-delete-failed'       => 'لم يتم الحذف حاول مرة اخرى لاحقا',
        ],
        'edit'=> [
            'title'                      => 'تعديل النطاق الحالي',
            'area-name'                  => ' الدولة او الحــي',
            'country'                    => ' البلدة',
            'state'                      => 'المنطقة',
            'view-edit-btn'              => 'تعديل',
            'edit-btn'                   => 'تحديث',
            'index-create-btn'           => 'إضافة',
            'select_country'             => 'اختر البلدة',
            'select_state'               => 'اختر المنطقة',
            'select_state_area'          => 'اختر الدولة او الحــي',
            'add_state'                  => 'اضافة منطقة',
            'add_area'                   => 'اضافة دولة او حــي',
            'no_states_for_country'      => 'لا توجد مناطق لهذه البلدة. الرجاء اختيار بلدة تحتوي على مناطق او اضف منطقة جديدة.',
            'no_areas_for_state'         => 'لا توجد دولة او حــي لهذه المنطقة. الرجاء اختيار منطقة تحتوي على دول او احياء او اضف دولة او حــي .',
            'edit-success'               => 'تم تحديث بيانات النطاق بنجاح.',
            'edit-failed'                => 'هذا المندوب مسجل بالفعل في هذه المنطقة الجغرافية',

        ],

    ],

    /*
|--------------------------------------------------------------------------
| قسم  الطلبات
|--------------------------------------------------------------------------
*/
    'select-order'=> [
        'index'=> [
            'select-delivery-agent-btn'     => 'تعيين مندوب التوصيل',
            'reselect-delivery-agent-btn'   => 'اعادة تعيين مندوب للطلب',
            'select-delivery-agent'         => 'تعيين المندوب للطلب رقــم #',
            'assign-btn'                    => 'تعيين',
            'tabs'                          => [
                'in-the-same-area'=> 'المتواجدون في :city',
                'all'             => 'كل المناديب',
            ],
            'assign-delivery-agent-confirmation'=> ' هل انت متاكد انك تريد تعيين هذا المندوب لهذا الطلب ',
        ],
        'create'=> [
            'create-success'    => 'تم تعيين المندوب بنجاح',
            'create-error'      => ' عذرا المندوب غير مفعل يرجى تفعيل المندوب اولا.',
            'order-has-delivery'=> 'تم تعيين مندوب مسبقًا لهذا الطلب',
        ],
        'update'=> [
            'update-failed' => 'عذا لايمكنك التعديل في حالة الطلب',
            'update-success'=> 'تم تحديث حالة الطلب بنجاح',
            'updated-error' => 'حدث خطا عند التعديل تحقق من  حالة المندوب ',
        ],
    ],
    'orders'=> [
        'view'=> [
            'delivery'                       => 'مندوب التوصيل',
            'no-delivery-agent-found'        => 'لم يتم تعيين مندوب لهذا الطلب',
            'view'                           => 'عرض',
            'contact'                        => 'اتصال',
            'item-delivered'                 => 'تم التوصيل (:qty_delivered)',

        ],
        'acl' => [
            'title'             => 'الطلـبيات',
            'select-delivery'   => 'تعيين مندوب للطلب',
            'create'            => 'إضافة',
            'edit'              => 'تحرير',
            'delete'            => 'حذف',
        ],
        'status' => [
            'pending'             => 'قيد الانتظار',
            'pending_payment'     => 'بانتظار الدفع',
            'processing'          => 'قيد المعالجة',
            'completed'           => 'مكتمل',
            'canceled'            => 'ملغي',
            'closed'              => 'مغلق',
            'fraud'               => 'احتيال',
            'assigned_to_agent'   => 'تم تعيين المندوب',
            'accepted_by_agent'   => ' تم قبول الطلب',
            'rejected_by_agent'   => 'تم رفض الطلب ',
            'out_for_delivery'    => 'قيد التوصيل',
            'delivered'           => 'تم التوصيل',
        ],
    ],
    'notifications'=> [
        'order-status-messages'=> [

            'assigned_to_agent'=> 'تم تعيين المندوب',
        ],
    ],

];
