<?php

return [

    /*
    |--------------------------------------------------------------------------
    | قسم موظفي التوصيل
    |--------------------------------------------------------------------------
    */

    'deliveryagents' => [

        'menu' => [
            'title'             => 'خدمات التوصيل',
            'delivery-agents'   => 'مندوبين التوصيل',
        ],

        'acl' => [
            'title'             => 'خدمات التوصيل',
            'delivery-agents'   => 'مندوبين التوصيل',
            'create'            => 'إضافة',
            'edit'              => 'تحرير',
            'delete'            => 'حذف',
        ],

        'index' => [
            'title' => 'قائمة مناديب التوصيل',
        ],

        'view' => [
            'title'         => 'المندوب',
            'back-btn'      => 'رجوع إلى القائمة',
            'delivery-agent'=> 'اسم المندوب',
            'first-name'    => 'الاسم الأول',
            'last-name'     => 'الاسم الأخير',
            'phone'         => 'رقم التواصل - :phone',
            'email'         => 'البريد الإلكتروني - :email',
            'date-of-birth' => 'تاريخ الميلاد - :dob',
            'gender'        => 'النوع - :gender',
            'status'        => 'الحالة الحالية',
            'active'        => 'مفعل',
            'inactive'      => 'غير مفعل',
            'edit-btn'      => 'تحرير',
            'datagrid'      => [
                'orders'        => [
                    'count'      => 'الطلبيات (:count)',
                    'empty-order'=> 'لا توجد طلبيات',
                ],
            ],

        ],

        'create' => [
            'title'             => 'إضافة مندوب توصيل جديد',
            'create-btn'        => 'حفظ البيانات',
            'create'            => 'إضافة مندوب',
            'first-name'        => 'الاسم الأول',
            'last-name'         => 'الاسم الأخير',
            'phone'             => 'رقم الهاتف',
            'email'             => 'البريد الإلكتروني',
            'date-of-birth'     => 'تاريخ الميلاد',
            'gender'            => 'النوع',
            'select-gender'     => 'اختر النوع',
            'male'              => 'ذكر',
            'female'            => 'أنثى',
            'other'             => 'أخرى',
            'password'          => 'الرقم السري',
            'confirm-password'  => 'تأكيد الرقم السري',
            'status'            => 'حالة الحساب',
            'select-status'     => 'اختر الحالة',
            'active'            => 'مفعل',
            'inactive'          => 'متوقف مؤقتًا',
            'create-success'    => 'تمت إضافة الموظف بنجاح.',
        ],

        'delete' => [
            'successful_deletion_message'   => 'تم حذف الموظف بنجاح.',
            'unsuccessful_deletion_message' => 'تعذر حذف الموظف. حاول لاحقًا.',
        ],

        'edit' => [
            'title'             => 'تحرير بيانات المندوب',
            'edit-btn'          => 'حفظ التعديلات',
            'save-btn'          => 'تحديث',
            'edit-success'      => 'تم تحديث بيانات المندوب بنجاح.',
            'first-name'        => 'الاسم الأول',
            'last-name'         => 'الاسم الأخير',
            'phone'             => 'رقم الهاتف',
            'email'             => 'البريد الإلكتروني',
            'date-of-birth'     => 'تاريخ الميلاد',
            'gender'            => 'النوع',
            'select-gender'     => 'اختر النوع',
            'male'              => 'ذكر',
            'female'            => 'أنثى',
            'other'             => 'أخرى',
            'password'          => 'الرقم السري',
            'confirm-password'  => 'تأكيد الرقم السري',
            'status'            => 'حالة الحساب',
            'select-status'     => 'اختر الحالة',
            'active'            => 'مفعل',
            'inactive'          => 'متوقف مؤقتًا',
        ],

        'datagrid' => [
            'id'                => 'المعرف',
            'id-value'          => 'المعرف - :id',
            'name'              => 'اسم المندوب',
            'phone'             => 'رقم الهاتف',
            'email'             => 'البريد الإلكتروني',
            'gender'            => 'الجنس',
            'status'            => 'الحالة',
            'active'            => 'مفعل',
            'inactive'          => 'متوقف',
            'range-count'       => 'عدد النطاقات',
            'order_count'       => 'عدد الطلبيات',
            'range'             => ':range نطاق(نطاقات)',
            'order'             => ':order طلب(طلبيات)',
            'country'           => 'الدولة',
            'state'             => 'الولاية',
            'actions'           => [
                'view'  => 'عرض',
                'delete'=> 'حذف',
            ],
            'delete'        => 'حذف',
            'update-status' => 'تحديث الحالة',
            'delete-success'=> 'تم حذف المندوب بنجاح',
            'update-success'=> 'تم نحديث الحالة بنجاح',

        ],

        'form' => [
            'name'      => 'الاسم الكامل',
            'phone'     => 'رقم الهاتف',
            'email'     => 'البريد الإلكتروني',
            'password'  => 'كلمة المرور',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | قسم المناطق (المدن والولايات)
    |--------------------------------------------------------------------------
    */

    'country' => [

        'menu' => [
            'title'     => 'نطاقات التوصيل',
            'countries' => 'البلدان',
        ],

        'acl' => [
            'title'         => 'نطاقات التوصيل',
            'countries'     => 'البلدان',
            'create'        => 'إضافة ',
            'edit'          => 'تحرير ',
            'delete'        => 'حذف ',
        ],

        'datagrid' => [
            'id'            => 'المعرف',
            'name'          => 'اسم البلدة',
            'code'          => 'رمز البلدة',
            'states_count'  => 'عدد المناطق',
            'actions'       => [
                'view'  => 'عرض',
                'delete'=> 'حذف',
            ],
            'delete-success'           => 'تم الحذف  بنجاح',
            'no-resource'              => 'لم يتم الحذف بنجاح',
            'mass-delete-success'      => 'تم الحذف  بنجاح',
            'delete_warning_has_states'=> 'لا يمكن حذف هذه البلدة لأنها تحتوي على نطاقات مرتبطة.',
        ],

        'index' => [
            'title' => 'قائمة البلدان المتاحة',
        ],

        'create' => [
            'title'             => 'إضافة بلدة جديدة',
            'name'              => 'اسم البلدة',
            'code'              => 'رمز البلدة',
            'create-btn'        => 'حفظ ',
            'index-create-btn'  => 'إضافة بلدة',
            'create-success'    => 'تمت إضافة البلدة بنجاح.',
        ],

        'view' => [
            'title'               => 'تفاصيل البلدة',
            'back-btn'            => 'رجوع',
            'delete-btn'          => 'حذف البلدو',
            'country'             => 'البلدة',
            'name'                => 'اسم البلدة',
            'code'                => 'رمز البلدة',

            'states' => [
                'count'         => 'عدد المناطق :count',
                'create-btn'    => 'إضافة منطقة جديدة',
            ],
        ],

        'edit' => [
            'title'         => 'تحرير بيانات البلدة',
            'name'          => 'اسم البلدة',
            'code'          => 'رمز البلدة',
            'edit-btn'      => 'تحرير',
            'edit-success'  => 'تم تحديث بيانات البلدة بنجاح.',
        ],

        'state' => [
            'acl' => [
                'states'        => 'المناطق',
                'view'          => 'عرض ',
                'create'        => 'إضافة ',
                'edit'          => 'تحرير ',
                'delete'        => 'حذف ',
            ],
            'create' => [
                'title'             => 'إضافة منطقة جديدة',
                'name'              => 'اسم المنطقة',
                'code'              => 'رمز المنطقة',
                'create-btn'        => 'حفظ المنطقة',
                'create-success'    => 'تم حفظ المنطقة بنجاح.',
            ],
            'view' => [
                'title'                => 'تفاصيل المنطقة ',
                'back-btn'             => 'رجوع',
                'delete-btn'           => 'حذف المنطقة',
                'state'                => 'المنطقة',
                'create-area-btn'      => 'إضافة مدينة - حي سكني',
                'name'                 => 'اسم المنطقة',
                'code'                 => 'رمز المنطقة',
            ],
            'edit' => [
                'title'         => 'تحرير بيانات المنطقة',
                'name'          => 'اسم المنطقة',
                'code'          => 'رمز المنطقة',
                'edit-btn'      => 'تحرير',
                'edit-success'  => 'تم تحديث بيانات المنطقة بنجاح.',
            ],

            'datagrid' => [
                'id'                => 'الـمعرف',
                'name'              => 'اسم المنطقة',
                'code'              => 'رمز المنطقة',
                'actions'           => [
                    'view'  => 'عرض',
                    'delete'=> 'حذف',
                ],
                'delete-success'           => 'تم الحذف المنطقة بنجاح',
                'no-resource'              => 'لم يتم المنطقة الحذف بنجاح',
                'mass-delete-success'      => 'تم الحذف  بنجاح',
            ],
            'area'=> [
                'create'=> [
                    'title'         => 'إضافة مدينة / حي جديد',
                    'name'          => 'اسم المدينة او الحــي',
                    'save-btn'      => 'حفظ',
                    'create-success'=> 'تم اضافة المدينة بنجاح',

                ],
                'edit'=> [
                    'title'         => 'تعديل المدينة او الحــي ',
                    'name'          => 'اسم المدينة او الحــي',
                    'edit-btn'      => 'تعديل',
                    'edit-success'  => 'تم التحديث بنجاح',
                ],
                'update'=> [

                ],
                'datagrid'=> [
                    'id'             => 'المعرف',
                    'name'           => 'اسم المدينة او الحــي',
                    'deleivery_count'=> 'عدد المناديب',
                    'actions'        => [
                        'edit'  => 'تعديل',
                        'delete'=> 'حذف',
                    ],
                    'delete-success'=> 'تم الحذف بنجاح',
                    'no-resource'   => 'فشلت عملية الحذف',

                ],
            ],
        ],
    ],
    /*
   |--------------------------------------------------------------------------
   | قسم النطاقات الخاصة بالمندوبين والمناطق
   |--------------------------------------------------------------------------
   */
    'range'=> [
        'index' => [
            'title' => 'قائمة المدن المتاحة',

        ],
        'acl'=> [
            'title'         => 'نطاقات المندوب',
            'create'        => 'إضافة ',
            'edit'          => 'تحرير ',
            'delete'        => 'حذف ',
        ],
        'create' => [
            'title'                      => 'إضافة نطاق جديد',
            'area-name'                  => ' المدينة او الحــي',
            'country'                    => ' البلدة',
            'state'                      => 'المنطقة',
            'create-btn'                 => 'حفظ النطاق',
            'index-create-btn'           => 'إضافة',
            'select_country'             => 'اختر البلدة',
            'select_state'               => 'اختر المنطقة',
            'select_state_area'          => 'اختر الدولة او الحــي',
            'add_state'                  => 'اضافة منطقة',
            'add_area'                   => 'اضافة دولة او حــي',
            'no_states_for_country'      => 'لا توجد مناطق لهذه البلدة. الرجاء اختيار بلدة تحتوي على مناطق او اضف منطقة جديدة.',
            'no_areas_for_state'         => 'لا توجد دولة او حــي لهذه المنطقة. الرجاء اختيار منطقة تحتوي على دول او احياء او اضف دولة او حــي .',
            'create-success'             => 'تمت إضافة النطاق للمندوب بنجاح.',
            'create-failed'              => 'هذا المندوب مسجل بالفعل في هذه المنطقة الجغرافية.',
        ],
        'view'=> [
            'count'                     => 'عدد النطاقات (:count)',
            'empty-title'               => 'إضافة نطاق للمندوب',
            'empty-description'         => 'إنشاء نطاقات جديدة للمندوب',
            'delete-btn'                => 'حذف',
            'range-delete-confirmation' => 'هل أنت متأكد أنك تريد حذف هذا النطاق؟',
            'range-delete-success'      => 'تم حذف النطاق بنجاح',
        ],
        'edit'=> [
            'title'                      => 'تعديل النطاق الحالي',
            'area-name'                  => ' الدولة او الحــي',
            'country'                    => ' البلدة',
            'state'                      => 'المنطقة',
            'view-edit-btn'              => 'تعديل',
            'edit-btn'                   => 'تحديث',
            'index-create-btn'           => 'إضافة',
            'select_country'             => 'اختر البلدة',
            'select_state'               => 'اختر المنطقة',
            'select_state_area'          => 'اختر الدولة او الحــي',
            'add_state'                  => 'اضافة منطقة',
            'add_area'                   => 'اضافة دولة او حــي',
            'no_states_for_country'      => 'لا توجد مناطق لهذه البلدة. الرجاء اختيار بلدة تحتوي على مناطق او اضف منطقة جديدة.',
            'no_areas_for_state'         => 'لا توجد دولة او حــي لهذه المنطقة. الرجاء اختيار منطقة تحتوي على دول او احياء او اضف دولة او حــي .',
            'edit-success'               => 'تم تحديث بيانات النطاق بنجاح.',

        ],

    ],

    /*
|--------------------------------------------------------------------------
| قسم  الطلبات
|--------------------------------------------------------------------------
*/
    'select-order'=> [
        'index'=> [
            'select-delivery-agent-btn'=> 'تعيين مندوب التوصيل',
            'reselect-delivery-agent-btn'   => 'اعادة تعيين مندوب للطلب',
            'select-delivery-agent'    => 'تعيين المندوب للطلب رقــم #',
            'tabs'                     => [
                'in-the-same-area'=> 'المتواجدون في :city',
                'all'             => 'الكل',
            ],
            'assign-delivery-agent-confirmation'=> ' هل انت متاكد انك تريد تعيين هذا المندوب لهذا الطلب ',
        ],
        'create'=> [
            'create-success'    => 'تم تعيين المندوب بنجاح',
            'create-error'      => 'المندوب غير مفعل أو لا يمتلك نطاقات.',
            'order-has-delivery'=> 'تم تعيين مندوب مسبقًا لهذا الطلب',
        ],
    ],
    'orders'=> [
        'view'=> [
            'delivery-agent'=> 'التوصيل',
            'delivery'=>[

            ]
        ],
        'acl' => [
            'title'             => 'الطلـبيات',
            'select-delivery'   => 'تعيين مندوب للطلب',
            'create'            => 'إضافة',
            'edit'              => 'تحرير',
            'delete'            => 'حذف',
        ],
        'status' => [
            'pending'             => 'قيد الانتظار',
            'pending_payment'     => 'بانتظار الدفع',
            'processing'          => 'قيد المعالجة',
            'completed'           => 'مكتمل',
            'canceled'            => 'ملغي',
            'closed'              => 'مغلق',
            'fraud'               => 'احتيال',

            'assigned_to_agent'   => 'مُعيّن لمندوب التوصيل',
            'accepted_by_agent'   => 'مقبول من المندوب',
            'rejected_by_agent'   => 'مرفوض من المندوب',
            'out_for_delivery'    => 'خارج للتوصيل',
            'delivered'           => 'تم التوصيل',
        ],
    ],

];
