<?php

return [

    /*
    |--------------------------------------------------------------------------
    | قسم موظفي التوصيل
    |--------------------------------------------------------------------------
    */

    'deliveryagents' => [

        'menu' => [
            'title'             => 'خدمات التوصيل',
            'delivery-agents'   => 'مندوبين التوصيل',
        ],

        'acl' => [
            'title'             => 'خدمات التوصيل',
            'delivery-agents'   => 'مندوبين التوصيل',
            'view-details'      => 'عرض التفاصيل',
            'create'            => 'إضافة مندوب',
            'edit'              => 'تحرير البيانات',
            'delete'            => 'حذف المندوب',
        ],

        'index' => [
            'title' => 'قائمة مندوبي التوصيل',
        ],

        'view' => [
            'title'         => 'المندوب',
            'back-btn'      => 'رجوع إلى القائمة',
            'delivery-agent'=> 'اسم المندوب',
            'first-name'    => 'الاسم الأول',
            'last-name'     => 'الاسم الأخير',
            'phone'         => 'رقم التواصل - :phone',
            'email'         => 'البريد الإلكتروني - :email',
            'date-of-birth' => 'تاريخ الميلاد - :dob',
            'gender'        => 'النوع - :gender',
            'status'        => 'الحالة الحالية',
            'active'        => 'مفعل',
            'inactive'      => 'غير مفعل',
            'edit-btn'      => 'تحرير',
            'delete-btn'    => 'حذف المندوب',
        ],

        'create' => [
            'title'             => 'إضافة مندوب توصيل جديد',
            'create-btn'        => 'حفظ البيانات',
            'create'            => 'إضافة مندوب',
            'first-name'        => 'الاسم الأول',
            'last-name'         => 'الاسم الأخير',
            'phone'             => 'رقم الهاتف',
            'email'             => 'البريد الإلكتروني',
            'date-of-birth'     => 'تاريخ الميلاد',
            'gender'            => 'النوع',
            'select-gender'     => 'اختر النوع',
            'male'              => 'ذكر',
            'female'            => 'أنثى',
            'other'             => 'أخرى',
            'password'          => 'الرقم السري',
            'confirm-password'  => 'تأكيد الرقم السري',
            'status'            => 'حالة الحساب',
            'select-status'     => 'اختر الحالة',
            'active'            => 'مفعل',
            'inactive'          => 'متوقف مؤقتًا',
            'create-success'    => 'تمت إضافة الموظف بنجاح.',
        ],

        'delete' => [
            'successful_deletion_message'   => 'تم حذف الموظف بنجاح.',
            'unsuccessful_deletion_message' => 'تعذر حذف الموظف. حاول لاحقًا.',
        ],

        'edit' => [
            'title'             => 'تحرير بيانات المندوب',
            'edit-btn'          => 'حفظ التعديلات',
            'save-btn'          => 'تحديث',
            'edit-success'      => 'تم تحديث بيانات المندوب بنجاح.',
            'first-name'        => 'الاسم الأول',
            'last-name'         => 'الاسم الأخير',
            'phone'             => 'رقم الهاتف',
            'email'             => 'البريد الإلكتروني',
            'date-of-birth'     => 'تاريخ الميلاد',
            'gender'            => 'النوع',
            'select-gender'     => 'اختر النوع',
            'male'              => 'ذكر',
            'female'            => 'أنثى',
            'other'             => 'أخرى',
            'password'          => 'الرقم السري',
            'confirm-password'  => 'تأكيد الرقم السري',
            'status'            => 'حالة الحساب',
            'select-status'     => 'اختر الحالة',
            'active'            => 'مفعل',
            'inactive'          => 'متوقف مؤقتًا',
        ],

        'datagrid' => [
            'id'             => 'المعرف',
            'id-value'       => 'المعرف - :id',
            'name'           => 'اسم المندوب',
            'phone'          => 'رقم الهاتف',
            'email'          => 'البريد الإلكتروني',
            'gender'         => 'الجنس',
            'status'         => 'الحالة',
            'active'         => 'مفعل',
            'inactive'       => 'متوقف',
            'range-count'    => 'عدد النطاقات',
            'range'          => ':range نطاق(نطاقات)',
            'country'        => 'الدولة',
            'state'          => 'الولاية',

        ],

        'form' => [
            'name'      => 'الاسم الكامل',
            'phone'     => 'رقم الهاتف',
            'email'     => 'البريد الإلكتروني',
            'password'  => 'كلمة المرور',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | قسم المناطق (المدن والولايات)
    |--------------------------------------------------------------------------
    */

    'country' => [

        'menu' => [
            'title'     => 'نطاقات التوصيل',
            'countries' => 'المدن',
        ],

        'acl' => [
            'title'         => 'نطاقات التوصيل',
            'countries'     => 'المدن',
            'view-details'  => 'عرض التفاصيل',
            'create'        => 'إضافة مدينة',
            'edit'          => 'تحرير مدينة',
            'delete'        => 'حذف مدينة',
        ],

        'datagrid' => [
            'id'    => 'المعرف',
            'name'  => 'اسم المدينة',
            'code'  => 'رمز المدينة',
        ],

        'index' => [
            'title' => 'قائمة المدن المتاحة',
        ],

        'create' => [
            'title'             => 'إضافة مدينة جديدة',
            'name'              => 'اسم المدينة',
            'code'              => 'رمز المدينة',
            'create-btn'        => 'حفظ المدينة',
            'index-create-btn'  => 'إضافة مدينة',
            'create-success'    => 'تمت إضافة المدينة بنجاح.',
        ],

        'view' => [
            'title'               => 'تفاصيل المدينة',
            'back-btn'            => 'رجوع',
            'delete-btn'          => 'حذف المدينة',
            'country'             => 'المدينة',
            'name'                => 'اسم المدينة',
            'code'                => 'رمز المدينة',

            'states' => [
                'count'         => 'عدد المناطق: :count',
                'create-btn'    => 'إضافة منطقة جديدة',
            ],
        ],

        'edit' => [
            'title'         => 'تحرير بيانات المدينة',
            'name'          => 'اسم المدينة',
            'code'          => 'رمز المدينة',
            'edit-btn'      => 'تحرير',
            'edit-success'  => 'تم تحديث بيانات المدينة بنجاح.',
        ],

        'state' => [
            'create' => [
                'title'             => 'إضافة منطقة جديدة',
                'name'              => 'اسم المنطقة',
                'code'              => 'رمز المنطقة',
                'create-btn'        => 'حفظ المنطقة',
                'create-success'    => 'تم حفظ المنطقة بنجاح.',
            ],
            'view' => [
                'title'               => 'تفاصيل المنطقة ',
                'back-btn'            => 'رجوع',
                'delete-btn'          => 'حذف المنطقة',
                'state'               => 'المنطقة',

                'name'              => 'اسم المنطقة',
                'code'              => 'رمز المنطقة',
            ],
            'edit' => [
                'title'         => 'تحرير بيانات المنطقة',
                'name'          => 'اسم المنطقة',
                'code'          => 'رمز المنطقة',
                'edit-btn'      => 'تحرير',
                'edit-success'  => 'تم تحديث بيانات المنطقة بنجاح.',
            ],

            'datagrid' => [
                'id'                => 'الـمعرف',
                'name'              => 'اسم المنطقة',
                'code'              => 'رمز المنطقة',
            ],
        ],
    ],
    /*
   |--------------------------------------------------------------------------
   | قسم النطاقات الخاصة بالمندوبين والمناطق
   |--------------------------------------------------------------------------
   */
    'range'=> [
        'index' => [
            'title' => 'قائمة المدن المتاحة',

        ],
        'create' => [
            'title'                 => 'إضافة نطاق جديد',
            'area-name'             => 'اسم الحي',
            'country'               => ' المدينة',
            'state'                 => 'الولاية',
            'create-btn'            => 'حفظ النطاق',
            'index-create-btn'      => 'إضافة',
            'select_country'        => 'اختر الدولة',
            'select_state'          => 'اختر الولاية',
            'add_state'             => 'اضافة ولاية',
            'no_states_for_country' => 'لا توجد ولايات لهذه الدولة. الرجاء اختيار دولة تحتوي على ولايات او اضف ولاية جديدة.',
            'create-success'        => 'تمت إضافة النطاق للمندوب بنجاح.',
        ],
        'view'=> [
            'count'            => 'عدد النطاقات (:count)',
            'empty-title'      => 'إضافة نطاق للمندوب',
            'empty-description'=> 'إنشاء نطاقات جديدة للمندوب',
            'delete-btn'       => 'حذف',

        ],
        'edit'=> [
            'edit-btn'    => 'تعديل',
            'edit-success'=> 'تم تحديث بيانات المنطقة بنجاح.',

        ],

    ],

    /*
|--------------------------------------------------------------------------
| قسم  الطلبات
|--------------------------------------------------------------------------
*/
    'select-order'=> [
        'index'=> [
            'select-delivery-agent-btn'=> 'تعيين مندوب التوصيل',
            'select-delivery-agent'    => 'تعيين المندوب للطلب رقــم #',
        ],
        'create'=>[
            'create-success'=>'تم تعيين المندوب بنجاح',
            'create-error'=>'المندوب غير مفعل أو لا يمتلك نطاقات.',
            'order-has-delivery'=>'تم تعيين مندوب مسبقًا لهذا الطلب'
        ]
    ],

];
